Tekla.Structures.ModelInternal.dotLegFace_t
Struct for the Leg face.

Tekla.Structures.ModelInternal.dotLegFace_t.Id
Database id.

Tekla.Structures.ModelInternal.dotLegFace_t.AdditonalOffset
The additional offset.

Tekla.Structures.ModelInternal.dotLegFace_t.PrimaryContour
The main outer contour of the face.

Tekla.Structures.ModelInternal.dotLegFace_t.SurfaceType
The type of geometric surface.